InformationRegisters/ПараметрыСозданияПользователейФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыСозданияПользователейФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидАдресаЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВключатьВебСсылкуВУведомление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаголовокУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассылатьУведомленияАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещеноИзменятьПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказыватьВСпискеВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПараметрыСозданияПользователейФизическихЛицГруппыДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыСозданияПользователейФизическихЛицГруппыДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПараметрыЗапретаДоступаУволеннымСотрудникамИсключаемыеФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыЗапретаДоступаУволеннымСотрудникамИсключаемыеФизическиеЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/СамообслуживаниеСотрудниковСобытия/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура СозданиеПользователейФизическихЛиц() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.СозданиеПользователейФизическихЛиц);
	
	Если Не ПолучитьФункциональнуюОпцию("СоздаватьПользователейДляПринятыхНаРаботуСотрудниковАвтоматически") Тогда 
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПараметрыСозданияПользователейФизическихЛиц.ВидАдресаЭлектроннойПочты КАК ВидАдресаЭлектроннойПочты,
		|	ПараметрыСозданияПользователейФизическихЛиц.ВключатьВебСсылкуВУведомление КАК ВключатьВебСсылкуВУведомление,
		|	ПараметрыСозданияПользователейФизическихЛиц.ЗаголовокУведомления КАК ЗаголовокУведомления,
		|	ПараметрыСозданияПользователейФизическихЛиц.РассылатьУведомленияАвтоматически КАК РассылатьУведомленияАвтоматически,
		|	ПараметрыСозданияПользователейФизическихЛиц.ШаблонУведомления КАК ШаблонУведомления,
		|	ПараметрыСозданияПользователейФизическихЛиц.ГруппаПользователей КАК ГруппаПользователей,
		|	ИСТИНА КАК АутентификацияСтандартная,
		|	ПараметрыСозданияПользователейФизическихЛиц.ЗапрещеноИзменятьПароль КАК ЗапрещеноИзменятьПароль,
		|	ПараметрыСозданияПользователейФизическихЛиц.ПоказыватьВСпискеВыбора КАК ПоказыватьВСпискеВыбора
		|ИЗ
		|	РегистрСведений.ПараметрыСозданияПользователейФизическихЛиц КАК ПараметрыСозданияПользователейФизическихЛиц";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда 
		Возврат;
	КонецЕсли;
	
	НастройкиПользователей = СамообслуживаниеСотрудниковКлиентСервер.ОписаниеНастроекСозданияПользователей();
	ЗаполнитьЗначенияСвойств(НастройкиПользователей, Выборка);
	
	НастройкиСообщений = СамообслуживаниеСотрудниковКлиентСервер.ОписаниеНастроекОтправкиУведомлений();
	ЗаполнитьЗначенияСвойств(НастройкиСообщений, Выборка);
	
	ДатаПолученияДанных = ТекущаяДатаСеанса();
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудников.НачалоПериода = ДатаПолученияДанных;
	ПараметрыПолученияСотрудников.ОкончаниеПериода = ДатаПолученияДанных;
	ПараметрыПолученияСотрудников.КадровыеДанные = "ФизическоеЛицо, Фамилия, Имя, Отчество";
	
	СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Ложь, ПараметрыПолученияСотрудников);
	
	СписокФизическихЛиц = ОбщегоНазначения.ВыгрузитьКолонку(СотрудникиОрганизации, "ФизическоеЛицо", Истина);
	ПользователиФизическихЛиц = СамообслуживаниеСотрудников.ПользователиФизическихЛиц(СписокФизическихЛиц);
	
	ВидКонтактнойИнформации = ?(ЗначениеЗаполнено(Выборка.ВидАдресаЭлектроннойПочты), Выборка.ВидАдресаЭлектроннойПочты, Неопределено);
	ЭлектронныеАдреса = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(СписокФизическихЛиц, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, ВидКонтактнойИнформации);
	
	СозданныеПользователи = Новый Массив;
	
	Для Каждого СтрокаСотрудника Из СотрудникиОрганизации Цикл 
		Если ПользователиФизическихЛиц[СтрокаСотрудника.ФизическоеЛицо] <> Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		ДанныеСотрудника = Новый Структура("ФизическоеЛицо, Фамилия, Имя, Отчество, АдресЭлектроннойПочты");
		ЗаполнитьЗначенияСвойств(ДанныеСотрудника, СтрокаСотрудника);
		
		ДанныеЭлектронногоАдреса = ЭлектронныеАдреса.Найти(ДанныеСотрудника.ФизическоеЛицо, "Объект");
		Если ДанныеЭлектронногоАдреса <> Неопределено Тогда 
			ДанныеСотрудника.АдресЭлектроннойПочты = ДанныеЭлектронногоАдреса.Представление;
		КонецЕсли;
		
		Пользователь = СамообслуживаниеСотрудников.НовыйПользователь(ДанныеСотрудника, НастройкиПользователей, НастройкиСообщений);
		ПользователиФизическихЛиц.Вставить(СтрокаСотрудника.ФизическоеЛицо, Пользователь);
		СозданныеПользователи.Добавить(Пользователь);
	КонецЦикла;	
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПараметрыСозданияПользователейФизическихЛицГруппыДоступа.ГруппаДоступа КАК ГруппаДоступа
		|ИЗ
		|	РегистрСведений.ПараметрыСозданияПользователейФизическихЛицГруппыДоступа КАК ПараметрыСозданияПользователейФизическихЛицГруппыДоступа";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ГруппаДоступаОбъект = Выборка.ГруппаДоступа.ПолучитьОбъект();
		Для Каждого СозданныйПользователь Из СозданныеПользователи Цикл 
			ГруппаДоступаОбъект.Пользователи.Добавить().Пользователь = СозданныйПользователь;
		КонецЦикла;
		ГруппаДоступаОбъект.Записать();
	КонецЦикла;	

КонецПроцедуры

Процедура ЗапретНаВходВПрограммуУволеннымРаботникам() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ЗапретНаВходВПрограммуУволеннымРаботникам);
	
	Если Не ПолучитьФункциональнуюОпцию("ЗапрещатьВходВПрограммуУволеннымСотрудникамАвтоматически") Тогда 
		Возврат;
	КонецЕсли;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ТекущийДень = НачалоДня(ТекущаяДатаСеанса());
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛицаИммунитет.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.ПараметрыЗапретаДоступаУволеннымСотрудникамИсключаемыеФизическиеЛица КАК ФизическиеЛицаИммунитет";
	ФизическиеЛицаИммунитет = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	
	ПараметрыСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыСотрудников.КадровыеДанные = "ДатаУвольнения";
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыСотрудников.Отборы, "ДатаУвольнения", "<>", "ДАТАВРЕМЯ(1, 1, 1)");
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыСотрудников.Отборы, "ДатаУвольнения", "<", ТекущийДень);
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыСотрудников.Отборы, "ФизическоеЛицо", "НЕ В", ФизическиеЛицаИммунитет);
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(МенеджерВТ, Ложь, ПараметрыСотрудников, "ВТУволенныеСотрудники");
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизическиеЛицаУволенных
		|ИЗ
		|	ВТУволенныеСотрудники КАК Сотрудники";
	Запрос.Выполнить();
	
	ПараметрыСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоВременнойТаблице();
	ПараметрыСотрудников.ИмяВТФизическиеЛица = "ВТФизическиеЛицаУволенных";
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(МенеджерВТ, Ложь, ПараметрыСотрудников, "ВТРаботающиеСотрудники");
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТРаботающиеСотрудники");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, "ФизическоеЛицо, ДатаУвольнения");
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТФизическиеЛицаУволенных КАК ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК ВТКадровыеДанныеСотрудников
		|		ПО (ВТКадровыеДанныеСотрудников.ФизическоеЛицо = ФизическиеЛица.ФизическоеЛицо)
		|		И (ВТКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ВТКадровыеДанныеСотрудников.ДатаУвольнения >= &ТекущийДень)
		|ГДЕ
		|	ВТКадровыеДанныеСотрудников.Сотрудник ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ТекущийДень", ТекущийДень);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	УволенныеФизическиеЛица = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	
	ПользователиФизическихЛиц = СамообслуживаниеСотрудников.ПользователиФизическихЛиц(УволенныеФизическиеЛица);
	Для Каждого КлючИЗначение Из ПользователиФизическихЛиц Цикл 
		Для Каждого ОписаниеПользователя Из КлючИЗначение.Значение Цикл
			Если Не ОписаниеПользователя.Недействителен Тогда 
				СамообслуживаниеСотрудников.УстановитьАутентификациюПользователя(ОписаниеПользователя.Пользователь, Ложь);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьИспользованиеМоегоОбученияРазвития(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьЭлектронноеОбучение = Источник.Значение;
	ИспользоватьПубликацииМероприятийОбученияРазвития = ПолучитьФункциональнуюОпцию("ИспользоватьПубликацииМероприятийОбученияРазвития");
	
	СамообслуживаниеСотрудников.УстановитьИспользованиеМоегоОбученияРазвития(ИспользоватьЭлектронноеОбучение, ИспользоватьПубликацииМероприятийОбученияРазвития);
	
КонецПроцедуры

#КонецОбласти
